app/controllers/bookings_controller.rb

  def new
    @booking = Booking.new
    @offer = Offer.find(params[:offer_id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @offer = Offer.find(params[:offer_id])
    @booking = Booking.new(booking_params)

    @booking.user = current_user
    @booking.offer = @offer

    if @booking.save
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookings" ("date_start", "date_end", "number_of_persons", "total_prices", "user_id", "offer_id", "created_at", "updated_at", "accepted") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @booking = Booking.find(params[:id])
    @booking.update(accepted: params[:accepted])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bookings" SET "updated_at" = $1, "accepted" = $2 WHERE "bookings"."id" = $3  [["updated_at", "2024-08-16 10:31:31.688128"], ["accepted", true], ["id", 2]]