app/controllers/offers_controller.rb

  def index
    @offers = Offer.all

    @markers = @offers.geocoded.map do |offer|
---
SELECT "offers".* FROM "offers" WHERE (offers.latitude IS NOT NULL AND offers.longitude IS NOT NULL)

  def show
    @offer = Offer.find(params[:id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @offer = Offer.new(offer_params)
    @offer.user = current_user
    if @offer.save
---
INSERT INTO "offers" ("user_id", "title", "description", "price", "address", "places", "created_at", "updated_at", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def edit
    @offer = Offer.find(params[:id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def update
    @offer = Offer.find(params[:id])
    if @offer.update(offer_params)
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "offers" SET "updated_at" = $1 WHERE "offers"."id" = $2  [["updated_at", "2024-08-15 12:37:47.744422"], ["id", 10]]

  def destroy
    @offer = Offer.find(params[:id])
    @offer.destroy
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "offers" WHERE "offers"."id" = $1  [["id", 10]]