app/models/offer.rb

SELECT "offers".* FROM "offers" WHERE (id < 5) ORDER BY "offers"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def next
    Offer.where("id > ?", id).order(:id).first

SELECT "offers".* FROM "offers" WHERE (id < 9) ORDER BY "offers"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def prev
    Offer.where("id < ?", id).order(:id).last